# -*- coding: utf-8 -*-
import random
class QuestionShuffler():
    """
    זה קלאס שעוזר לנהל את השאלות
    הוא קורא את הקובץ עם כל השאלות, מפריד אותם ונותן סימן לתשובות הנכונות
    הוא כולל בתוכו גם פונקציה ששולפת באקראי כל פעם שאלה אחרת
    """
    def __init__(self):
        """
        הפונקציה ההתחלתית ליצירת הקלאס. מבצעת לפי סדר:
        1. פותחת את קובץ השאלות לקריאה
        2. מכניסה אותו כמחרוזת למשתנה
        3. מפרידה את השאלות לפי הסימן ,|, (מתקבלת רשימה)
        4. מערבבת את רשימת השאלות
        5. סוגרת את הקובץ
        """
        f = open("questions_file.txt", "r")
        q_str = f.read()
        self.q_lst = q_str.split(",|,")
        random.shuffle(self.q_lst)
        f.close()

    def get_questions(self):
        """
        הפונקציה הזאת מוציאה כל פעם שאלה אחת מהרשימה.
        אם אין יותר שאלות ברשימה (המשתמש פתר הכל) היא מודיע שניצח ויצאת מהאפליקציה
        """
        if len(self.q_lst) == 0:
            """
            ככה בודקים אם הרשימה ריקה (האורך שלה הוא 0)
            """
            print("you win")
            exit(1)
        else:
            """
            אם רשימת השאלות לא ריקה:
            1. מפרידה את המחרוזות בשאלה לפי הסימן , (מתקבלת רשימה)
            2. לוקחת כל איבר ברשימה (שמכיל מחרוזת עברית עם שאלה או תשובה) וכותבת אותו מהסוף להתחלה,
            מכיוון שעברית זאת שפה הפוכה ואין פונקציה מובנית שמתקנת את הבאג הזה 
            3. בסוף היא מחזירה רשימה של מחרוזות
            """
            q_formatted = self.q_lst.pop(0).split(",")
            for q in range(len(q_formatted)):
                q_formatted[q] = q_formatted[q][::-1]
            return q_formatted
